## Series
## Data Frames
## Data Frame Index
## Multi Index Data Frame

# SERIES

In [63]:
import numpy as np
import pandas as pd

In [64]:
myDictionary = {"a": 50, "b": 30, "c": 15, "d": 70}

In [65]:
pd.Series(myDictionary)

a    50
b    30
c    15
d    70
dtype: int64

In [66]:
type(pd.Series(myDictionary))

pandas.core.series.Series

In [67]:
myValues = [10,20,30]
myKeys = ["x","y","z"]

In [68]:
pd.Series(myValues)

0    10
1    20
2    30
dtype: int64

In [69]:
pd.Series(myKeys)

0    x
1    y
2    z
dtype: object

In [70]:
pd.Series(myValues,myKeys)

x    10
y    20
z    30
dtype: int64

In [71]:
numpySeries = np.array([21,32,43])
numpySeries

array([21, 32, 43])

In [72]:
pd.Series(numpySeries)

0    21
1    32
2    43
dtype: int32

In [73]:
pd.Series(["k","m","n"],[1,2,3])

1    k
2    m
3    n
dtype: object

In [74]:
competitionScores1 = pd.Series([10,5,3],["r","e","d"])
competitionScores1

r    10
e     5
d     3
dtype: int64

In [75]:
competitionScores1["r"]

10

In [76]:
competitionScores2 = pd.Series([20,12,6],["r","e","d"])
competitionScores2

r    20
e    12
d     6
dtype: int64

In [77]:
lastScores = (competitionScores1 + competitionScores2)
lastScores

r    30
e    17
d     9
dtype: int64

In [78]:
diffSeries1 = pd.Series([20,30,60],["v","o","q"])
diffSeries2 = pd.Series([22,40,83],["o","v","w"])

In [79]:
lastDiffS = diffSeries1 + diffSeries2
lastDiffS

o    52.0
q     NaN
v    60.0
w     NaN
dtype: float64

# DATA FRAMES

In [80]:
np.random.randn

In [81]:
data = np.random.randn(3,2)
data

array([[-1.57176193,  0.72414042],
       [ 1.03679612,  0.00577393],
       [-1.05607443, -0.30883419]])

In [82]:
dataFrame = pd.DataFrame(data)

In [83]:
dataFrame

          0         1
0 -1.571762  0.724140
1  1.036796  0.005774
2 -1.056074 -0.308834

In [84]:
dataFrame[0]

0   -1.571762
1    1.036796
2   -1.056074
Name: 0, dtype: float64

In [85]:
type(dataFrame[0])

pandas.core.series.Series

In [86]:
newDataFrame = pd.DataFrame(data,index=["Ankara","Berlin","Madrid"],columns=["a","b"])

In [87]:
newDataFrame

               a         b
Ankara -1.571762  0.724140
Berlin  1.036796  0.005774
Madrid -1.056074 -0.308834

In [88]:
newDataFrame["a"]

Ankara   -1.571762
Berlin    1.036796
Madrid   -1.056074
Name: a, dtype: float64

In [89]:
newDataFrame.loc["Berlin"]

a    1.036796
b    0.005774
Name: Berlin, dtype: float64

In [90]:
newDataFrame.iloc[2]

a   -1.056074
b   -0.308834
Name: Madrid, dtype: float64

# DATA FRAME INDEX

In [91]:
newDataFrame["c"] = newDataFrame["a"] + newDataFrame["a"]
newDataFrame

               a         b         c
Ankara -1.571762  0.724140 -3.143524
Berlin  1.036796  0.005774  2.073592
Madrid -1.056074 -0.308834 -2.112149

In [92]:
newDataFrame.drop("c",axis=1)

               a         b
Ankara -1.571762  0.724140
Berlin  1.036796  0.005774
Madrid -1.056074 -0.308834

In [93]:
newDataFrame.drop("Ankara",axis=0)

               a         b         c
Berlin  1.036796  0.005774  2.073592
Madrid -1.056074 -0.308834 -2.112149

In [94]:
newDataFrame

               a         b         c
Ankara -1.571762  0.724140 -3.143524
Berlin  1.036796  0.005774  2.073592
Madrid -1.056074 -0.308834 -2.112149

In [95]:
newDataFrame.drop("c",axis=1, inplace=True)

newDataFrame

               a         b
Ankara -1.571762  0.724140
Berlin  1.036796  0.005774
Madrid -1.056074 -0.308834

In [96]:
newDataFrame.loc["Ankara"]["b"]

0.7241404191642381

In [97]:
newDataFrame.loc["Madrid","a"]

-1.056074429989976

In [100]:
booleanFrame = newDataFrame < 0

booleanFrame

            a      b
Ankara   True  False
Berlin  False  False
Madrid   True   True

In [101]:
newDataFrame[booleanFrame]

               a         b
Ankara -1.571762       NaN
Berlin       NaN       NaN
Madrid -1.056074 -0.308834

In [102]:
newDataFrame["a"] > 0

Ankara    False
Berlin     True
Madrid    False
Name: a, dtype: bool

In [103]:
newDataFrame[newDataFrame["a"] > 0]

               a         b
Berlin  1.036796  0.005774

In [105]:
newDataFrame.reset_index()

    index         a         b
0  Ankara -1.571762  0.724140
1  Berlin  1.036796  0.005774
2  Madrid -1.056074 -0.308834

In [106]:
newDataFrame

               a         b
Ankara -1.571762  0.724140
Berlin  1.036796  0.005774
Madrid -1.056074 -0.308834

# MULTI INDEX DATA FRAME